maurofain/test_wave/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_APP_I2C_PORT=0
CONFIG_APP_I2C_SDA_GPIO=27
CONFIG_APP_I2C_SCL_GPIO=26
CONFIG_APP_I2C_CLOCK_HZ=400000
CONFIG_APP_WS2812_GPIO=5
CONFIG_APP_WS2812_LEDS=8
CONFIG_APP_RS232_UART_PORT=1
CONFIG_APP_RS232_TX_GPIO=36
CONFIG_APP_RS232_RX_GPIO=46
CONFIG_APP_RS485_UART_PORT=2
CONFIG_APP_RS485_TX_GPIO=4
CONFIG_APP_RS485_RX_GPIO=3
CONFIG_APP_RS485_DE_GPIO=2
CONFIG_APP_MDB_UART_PORT=3
CONFIG_APP_MDB_TX_GPIO=22
CONFIG_APP_MDB_RX_GPIO=23
CONFIG_APP_PWM_OUT1_GPIO=47
CONFIG_APP_PWM_OUT2_GPIO=48
CONFIG_APP_WIFI_AP_SSID="factory-setup"
CONFIG_APP_WIFI_AP_PASSWORD="factory123"
CONFIG_APP_WIFI_AP_CHANNEL=6
CONFIG_APP_WIFI_STA_ENABLE=n
CONFIG_APP_WIFI_STA_SSID=""
CONFIG_APP_WIFI_STA_PASSWORD=""
CONFIG_APP_ETH_ENABLED=y
CONFIG_APP_ETH_PHY_ADDR=1
CONFIG_APP_ETH_PHY_RST_GPIO=51
CONFIG_APP_ETH_MDC_GPIO=31
CONFIG_APP_ETH_MDIO_GPIO=52
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=8192
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_MAIN_TASK_STACK_SIZE=16384
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=8192
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_RUN_TIME_STATS_USING_ESP_TIMER=y
CONFIG_LWIP_TCP_OVERSIZE_QUARTER_MSS=y
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_LWIP_MAX_ACTIVE_TCP=8
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=2920
CONFIG_LWIP_TCP_WND_DEFAULT=2920
CONFIG_LWIP_MAX_UDP_PCBS=8
CONFIG_LWIP_MAX_RAW_PCBS=4
CONFIG_APP_HTTP_PORT=80
CONFIG_APP_OTA_DEFAULT_URL=""
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=0
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUF=1
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=2
CONFIG_ESP_WIFI_STATIC_TX_BUFFER=y
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER=y
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUFFER=y
CONFIG_ESP_WIFI_NVS_COMPATIBLE=y

# PSRAM configuration for ESP32-P4 - solo opzioni valide
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y

CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
#CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
#CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# Supporto nomi file lunghi (LFN) per SD Card
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

CONFIG_ESP_WIFI_FTM_ENABLE=n
CONFIG_ESP_WIFI_ENABLE=y
CONFIG_ESP_WIFI_ITWT_ENABLE=n
CONFIG_ESP_WIFI_11AX_ENABLE=y

# BSP (Waveshare ESP32-P4-NANO) configuration from lvgl_demo_v9
CONFIG_BSP_ERROR_CHECK=y
CONFIG_BSP_I2C_NUM=1
CONFIG_BSP_I2C_FAST_MODE=y
CONFIG_BSP_I2C_CLK_SPEED_HZ=400000
CONFIG_BSP_I2S_NUM=1
CONFIG_BSP_SD_MOUNT_POINT="/sdcard"
CONFIG_BSP_SPIFFS_MOUNT_POINT="/spiffs"
CONFIG_BSP_SPIFFS_PARTITION_LABEL="storage"
CONFIG_BSP_SPIFFS_MAX_FILES=5
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=2
CONFIG_BSP_DISPLAY_LVGL_AVOID_TEAR=y
CONFIG_BSP_DISPLAY_LVGL_FULL_REFRESH=y
CONFIG_BSP_DISPLAY_BRIGHTNESS_LEDC_CH=1
CONFIG_BSP_LCD_COLOR_FORMAT_RGB565=y
# CONFIG_BSP_LCD_TYPE_720_1280_7_INCH_A is not set
CONFIG_BSP_LCD_TYPE_720_1280_10_1_INCH_B=y
CONFIG_BSP_LCD_MIPI_DSI_LANE_BITRATE_MBPS=1500

# LVGL configuration from lvgl_demo_v9
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=15
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_UNSCII_16=y
CONFIG_LV_USE_FS_STDIO=y
CONFIG_LV_FS_STDIO_LETTER=83
CONFIG_LV_FS_STDIO_PATH=""
CONFIG_LV_USE_TJPGD=y
CONFIG_LV_USE_SYSMON=n
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_USE_DEMO_WIDGETS=n
CONFIG_LV_USE_DEMO_BENCHMARK=n
CONFIG_LV_USE_DEMO_RENDER=n
CONFIG_LV_USE_DEMO_SCROLL=n
CONFIG_LV_USE_DEMO_STRESS=n
CONFIG_LV_USE_DEMO_TRANSFORM=n
CONFIG_LV_USE_DEMO_MUSIC=n
CONFIG_LV_DEMO_MUSIC_AUTO_PLAY=n
CONFIG_LV_USE_DEMO_FLEX_LAYOUT=n
CONFIG_LV_USE_DEMO_MULTILANG=n
CONFIG_LV_USE_IMGFONT=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# USB CDC Scanner defaults
CONFIG_USB_CDC_SCANNER_ENABLE=y
CONFIG_USB_OTG_SUPPORTED=y
CONFIG_USB_CDC_SCANNER_USE_CDC_ACM_HOST=y
CONFIG_USB_CDC_SCANNER_VID=0x1EAB
CONFIG_USB_CDC_SCANNER_PID=0x0006
CONFIG_USB_CDC_SCANNER_DUAL_PID=0x0000
# CONFIG_USB_HOST_HUBS_SUPPORTED is not set
# CONFIG_USB_HOST_HUB_MULTI_LEVEL is not set
CONFIG_USB_HOST_DWC_DMA_CAP_MEMORY_IN_PSRAM=y

# Policy log di boot: minimo rumore all'avvio, con margine di aumento runtime
CONFIG_BOOTLOADER_LOG_LEVEL_ERROR=y
CONFIG_BOOTLOADER_LOG_LEVEL=1
CONFIG_LOG_DEFAULT_LEVEL_ERROR=y
CONFIG_LOG_DEFAULT_LEVEL=1
# non vincolare il massimo al default: possiamo alzare runtime fino a INFO
# CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT is not set
# CONFIG_LOG_MAXIMUM_LEVEL_WARN is not set
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y
# massimo runtime consentito: INFO (es. regolazione dinamica da codice/API)
CONFIG_LOG_MAXIMUM_LEVEL=3

# Core dump persistente in flash (ELF)
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y

# pthread: stack di default aumentato (3072 troppo piccolo per mbedTLS/LwIP/vfprintf)
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=8192

# FreeRTOS timer task: aumentato per evitare overflow in callback con logging
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# httpd: più socket per gestire refresh paralleli dell'emulator senza error 113
CONFIG_HTTPD_MAX_OPEN_SOCKETS=12
CONFIG_ESP_SYSTEM_USE_FRAME_POINTER=y